6
For detailed explanation of this examples refer to [pandas -apply()function](https://sparkbyexamples.com/pandas/pandas-apply()-usage-with-examples)

# Pandas apply() Function to Single & Multiple Column(s)

In [1]:
import pandas as pd
import numpy as np
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
df

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [2]:
# Using apply function single column
def add_4(x):
   return x+4
df["B"] = df["B"].apply(add_4)
df

   A   B  C
0  3   9  7
1  2   8  6
2  5  12  9

In [3]:
# Using Dataframe.apply() to apply function multiple column
def add_3(x):
   return x+3
df2 = df.apply(add_3)
df2

   A   B   C
0  6  12  10
1  5  11   9
2  8  15  12

In [4]:
# apply() function on selected list of multiple columns
df = pd.DataFrame(data, columns = ['A','B','C'])
df[['A','B']] = df[['A','B']].apply(add_3)
df

   A   B  C
0  6   8  7
1  5   7  6
2  8  11  9

In [6]:
# apply a lambda function to each column
df = pd.DataFrame(data, columns = ['A','B','C'])
df2 = df.apply(lambda x : x + 10)
df2

    A   B   C
0  13  15  17
1  12  14  16
2  15  18  19

In [7]:
# Using Dataframe.apply() and lambda function
df["A"] = df["A"].apply(lambda x: x-2)
df

   A  B  C
0  1  5  7
1  0  4  6
2  3  8  9

In [9]:
# Using DataFrame.transform()
df = pd.DataFrame(data, columns = ['A','B','C'])
def add_2(x):
    return x+2
df = df.transform(add_2)
df

   A   B   C
0  5   7   9
1  4   6   8
2  7  10  11

In [10]:
# Using DataFrame.map() to Single Column
df = pd.DataFrame(data, columns = ['A','B','C'])
df['A'] = df['A'].map(lambda A: A/2.)
df

     A  B  C
0  1.5  5  7
1  1.0  4  6
2  2.5  8  9

In [12]:
# Using DataFrame.assign() and Lambdad
df = pd.DataFrame(data, columns = ['A','B','C'])
df2 = df.assign(B=lambda df: df.B/2)
df2

   A    B  C
0  3  2.5  7
1  2  2.0  6
2  5  4.0  9

In [13]:
# Using Dataframe.apply() & [] operator
df = pd.DataFrame(data, columns = ['A','B','C'])
df['A'] = df['A'].apply(np.square)
df

    A  B  C
0   9  5  7
1   4  4  6
2  25  8  9

In [14]:
# Using numpy.square() and [] operator
df = pd.DataFrame(data, columns = ['A','B','C'])
df['A'] = np.square(df['A'])
df

    A  B  C
0   9  5  7
1   4  4  6
2  25  8  9